; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	spectrograph3 - mode
	spectrograph1 - mode
	infrared2 - mode
	image0 - mode
	Star1 - direction
	GroundStation0 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph3)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 Star1)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph3)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
	(supports instrument6 infrared2)
	(supports instrument6 image0)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 infrared2)
	(supports instrument7 image0)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 Star4)
	(supports instrument8 spectrograph1)
	(supports instrument8 image0)
	(supports instrument8 infrared2)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument9 spectrograph3)
	(calibration_target instrument9 GroundStation3)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet5)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Planet10)
	(have_image Planet5 infrared2)
	(have_image Planet6 image0)
	(have_image Phenomenon7 image0)
	(have_image Star8 spectrograph1)
	(have_image Planet9 spectrograph1)
	(have_image Planet10 image0)
	(have_image Star11 spectrograph1)
	(have_image Star12 spectrograph3)
	(have_image Star13 spectrograph3)
	(have_image Phenomenon14 spectrograph3)
	(have_image Planet15 spectrograph1)
))

)

; plan
1. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 13
2. (calibrate satellite3 instrument8 groundstation2)
   added: (calibrated instrument8)
   goals met: 0 of 13
3. (turn_to satellite3 planet5 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet5)
   goals met: 0 of 13
4. (take_image satellite3 planet5 instrument8 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 1 of 13
5. (turn_to satellite3 planet15 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 planet15)
   goals met: 1 of 13
6. (take_image satellite3 planet15 instrument8 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 2 of 13
7. (turn_to satellite3 planet10 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 planet10)
   goals met: 2 of 13
8. (take_image satellite3 planet10 instrument8 image0)
   added: (have_image planet10 image0)
   goals met: 3 of 13
9. (turn_to satellite3 phenomenon7 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon7)
   goals met: 3 of 13
10. (turn_to satellite0 groundstation3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 13
11. (take_image satellite3 phenomenon7 instrument8 image0)
   added: (have_image phenomenon7 image0)
   goals met: 4 of 13
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 13
13. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 4 of 13
14. (turn_to satellite0 phenomenon14 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 13
15. (take_image satellite0 phenomenon14 instrument0 spectrograph3)
   added: (have_image phenomenon14 spectrograph3)
   goals met: 5 of 13
16. (turn_to satellite0 planet6 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet6)
   goals met: 5 of 13
17. (take_image satellite0 planet6 instrument0 image0)
   added: (have_image planet6 image0)
   goals met: 6 of 13
18. (turn_to satellite0 star12 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star12)
   goals met: 6 of 13
19. (take_image satellite0 star12 instrument0 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 7 of 13
20. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 7 of 13
21. (take_image satellite0 star13 instrument0 spectrograph3)
   added: (have_image star13 spectrograph3)
   goals met: 8 of 13
22. (turn_to satellite0 groundstation0 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation0)
   goals met: 9 of 13
23. (turn_to satellite1 planet10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet10)
   goals met: 10 of 13
24. (turn_to satellite3 planet9 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 planet9)
   goals met: 10 of 13
25. (take_image satellite3 planet9 instrument8 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 11 of 13
26. (turn_to satellite3 star11 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star11)
   goals met: 11 of 13
27. (take_image satellite3 star11 instrument8 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 12 of 13
28. (turn_to satellite3 star8 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star8)
   goals met: 12 of 13
29. (take_image satellite3 star8 instrument8 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 13 of 13
